000_РОЗНИЦА_ЦЕНТР/src/Catalogs/ВидыОплатЧекаККМ/ВидыОплатЧекаККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыОплатЧекаККМ</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>БанковскийКредит</name>
      <description>Банковский кредит</description>
    </items>
    <items>
      <name>Наличные</name>
      <description>Наличные</description>
    </items>
    <items>
      <name>ОплатаКартойИнтернетЗаказа</name>
      <description>Оплата картой интернет заказа</description>
    </items>
    <items>
      <name>ОплатаПлатежнойКартой</name>
      <description>Оплата платежной картой</description>
    </items>
    <items>
      <name>ОплатаПодарочнымСертификатом</name>
      <description>Оплата подарочным сертификатом</description>
    </items>
    <items>
      <name>Послеплата</name>
      <description>Пiсляплата</description>
    </items>
    <items>
      <name>Предоплата</name>
      <description>Передплата</description>
    </items>
  </predefined>
  <attributes>
    <name>БанкКредитор</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентБанковскойКомиссии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОплаты</name>
    <type>
      <types>EnumRef.ТипыОплатЧекаККМ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОплаты_ПРРО</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/Enums/ТипыОплатЧекаККМ/ТипыОплатЧекаККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыОплатЧекаККМ</name>
  <comment>(Упр)</comment>
  <enumValues>
    <name>Наличные</name>
  </enumValues>
  <enumValues>
    <name>ПлатежнаяКарта</name>
  </enumValues>
  <enumValues>
    <name>БанковскийКредит</name>
  </enumValues>
  <enumValues>
    <name>ПодарочныйСертификат</name>
  </enumValues>
  <enumValues>
    <name>Предоплата</name>
  </enumValues>
  <enumValues>
    <name>Послеплата</name>
    <comment>Только для интернет-магазина.</comment>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/ВидыОплатЧекаККМ/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

///////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Процедура заполняет предопределенные элементы статей движения денежных средств.
//
Процедура ЗаполнитьПредопределенные() Экспорт
	
	Соответствие = Новый Соответствие;
	Соответствие.Вставить(Справочники.ВидыОплатЧекаККМ.Наличные,
		Перечисления.ТипыОплатЧекаККМ.Наличные);
	Соответствие.Вставить(Справочники.ВидыОплатЧекаККМ.ОплатаПодарочнымСертификатом,
		Перечисления.ТипыОплатЧекаККМ.ПодарочныйСертификат);
	Соответствие.Вставить(Справочники.ВидыОплатЧекаККМ.Послеплата,
		Перечисления.ТипыОплатЧекаККМ.Послеплата);
	Соответствие.Вставить(Справочники.ВидыОплатЧекаККМ.Предоплата,
		Перечисления.ТипыОплатЧекаККМ.Предоплата);
		
	Для Каждого Элемент Из Соответствие Цикл
	
		СправочникОбъект = Элемент.Ключ.ПолучитьОбъект();
		Если НЕ СправочникОбъект.ТипОплаты = Элемент.Значение Тогда
			СправочникОбъект.ТипОплаты = Элемент.Значение;
			Попытка
				СправочникОбъект.УстановитьНовыйКод();
				СправочникОбъект.Записать();
			Исключение
			КонецПопытки;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Возвращает список реквизитов, которые не нужно редактировать
// с помощью обработки группового изменения объектов
//
Функция РеквизитыНеРедактируемыеВГрупповойОбработке() Экспорт
	
	НеРедактируемыеРеквизиты = Новый Массив;
	
	НеРедактируемыеРеквизиты.Добавить("ТипОплаты");
	НеРедактируемыеРеквизиты.Добавить("ИмяПредопределенныхДанных");
	НеРедактируемыеРеквизиты.Добавить("ТипОплаты_ПРРО");
	
	Возврат НеРедактируемыеРеквизиты;
	
КонецФункции

///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

#КонецЕсли
